#[ コネクト構文 ]

---[ `<T>()[]{}:(){}` ]---

##[ 概要 ]

処理としては、`()`や`{}`の中身を合体させる。そんだけ。

---[ 不安定なこと ]---
- `[]`はどうする？そもそも、`[]`は、複数値を記入できない(keyを付けられない)というTypedmarkの設計上の根本的なミスがある。
  - `[]`だけは、後から追加されたものに、`sub`みたいな階層にする？
- `@reference`には、どのElementに参照させるか(key)、実際にコネクトする値`()`、`{}`、`[]`を設定するわけだが、現在の`@reference`は、(key)をargsと一緒に設定してしまっている。
  - @ref(id):()[]{}?
    - この構文にすると、さらなる共通化が見えてくるかも？@ref()[]{}にコネクト構文がついたみいな

##[ `@reference`に ]

現在、未実装の`@reference`。ずっと構文を決めかねていたが、遠隔のコネクト構文の塊。
という考えはどうだろうか？

```(tm)
@references[
  <id:asdf-asdf>:(description: "詳しい説明を記入する？でも、データ内に改行アリで文章を書けるのが、Typedmarkの一つの特徴であるから、要検討。追加概念が必要かもしれない。")
  <id:asdf-asdf>:[
    <description>[ やるならおそらくこう。 ]
  ]
  <id:asdf-asd2>:{tag: important}
  <ids:[asdf-asdf, asdf-asd2]>:[ `:`は、新たなElementという認識が可能なため、idに複数値を設定して複数に同じものを共有させることが可能なのではなかろうか？ ]
]
```

##[ リスト構文に ]

現在のリスト構文は、

```(tm)
- () [ content ]{id: asdf-asdf}
または、
- () content {id: asdfasdf}となっている。 
```

しかし、`@`や`<T>`をトリガーとして囲い込みを行うという統一性のとれたTypedmarkにおいて、
`content {}`がちょっと腑に落ちない。（認知負荷が少しある。一貫性がないから。）
そこで、今回のコネクト構文の登場である。

```(tm)
- () content :{id: asdf-asdf}
```
