@settings(file:docs/docs.settings.tm)
@meta(type:todo)

---[ 構文を決定する ]---
- ( ) 設定DSL
- ( ) ValueDSL
- ( ) 要素設定
- ( ) `@footnote`
- ( ) `ref`構文                      // `@this`
- ( ) Table記法                      // `[]`
- ( ) コネクト構文                    // `:(){}`
- ( ) エスケープ構文                  // `\`が有力。
- ( ) Template構文
---[ 構文を実装する ]---
- ( ) `args`推論                    // `key:`がない場合に、要素の必須argの順番と解釈する。
- ( ) `@`推論                       // `url`などのargを見て、`@xxx`を推論する
- ( ) ビルトイン関数の強化             // `@link`,`@`, `<index>`, `<callout>`, `@tag`
- ( ) Elementの挙動を一般化           // 設定で決める
- ( ) `@meta`にkdlを追加
---[ 拡張性を確保する ]---
- ( ) ドキュメントの補充
- ( ) アイコン、ロゴ
- ( ) IDEサポート
---[ CLI/Library機能を強化する ]---
- ( ) 置換/検索
- ( ) 変換を強化
- ( ) TUIエディター
- ( ) Webエディター
- ( ) Svelte向けパッケージ
- ( ) React向けパッケージ
- ( ) Hook                           // 実行すると、規則に従って、指定されたトリガーを見て、処理を実行する（TODO）をアーカイブするとかのはなし。
---[ 外部機能を強化する ]---
- ( ) Zed
  - ( ) フォーマッタ
  - ( ) サジェスト
  - ( ) 自動補完
- ( ) 多言語バインディング
- ( ) その他

#[ Archive ]
---[ 構文 ]---
- (x) 代入、関数構文                   // `${var}` `compute`,`resolve`
- (x) 構文エラー (重複)
- (x) コメントアウト
- (x) 基本構文 (空白可, 改行可, 順不同)
- (x) 基本Markdown記法 (`*`, `**`, `==`, `__`, ``)
- (x) 基本要素 (heading, list, horizontal line)
- (x) 名前 (element, arg, content, value)
- (x) 基本AST (`<T>()[]{}`)
