@settings(path:../../docs.settings.tm)
@meta{}

#[ 雛形 ] 

```tm
@xxx(input)[area]{value}
@()[]{}
<T>()[]{}
#()[]{}
##()[]{}
-.()[]{}
-()[]{}
---[]---
${}
$()
// xxx
/*  */
```

#[ 派生 ]

##[ 柔軟性 ]

```tm
<T>()             // 括弧削減

<T>{}()[]         // 並び替え

@xxx () [] {}     // 1スペース
# []              // 1スペース

<T>(){}           // 改行
[]                // 改行
```

##[ コネクト ]

```tm
- () xxxxxx :{}
```

#[ 対応Markdown記法 ]

```tm
---               // 線
*xxx*
**xxx**
==xxx==           // マーカー
_xxx_
`xxx`             // ブロック
\`\`\`tm          // コードブロック
\`\`\`            // コードブロック

| table | ----- | // テーブル
|     1 |     2 | // テーブル
```

#[ 軽量変数言語 ]

```tm
key:value,
group.key:value
group{key:value, key:value}
```

#[ 駄目な構文 ]

```
@xxx()(){}{}[][]    // 複数括弧

@xxx()[]{}          // 値なし(null)
```
