- <T()>はどう？
  - <T(){}>記法？
  - []がない関数の書き方としていい感じにまとまっている？
  - <T()>{}[]こうか？
  - (!) `()`の中身は、必須プロパティ。
    - 可読性を向上させようと思ったが、逆効果の可能性がある。
- <var>(boolean){ bool1:true, }
- $(var) or ${var} or {{var}}
  - これ、もしかして共通記法じゃないか？
  - $と{}で。しかし共通の場合、$()じゃないか？
- ```tmと```(tm)あるいは```(lang:tm)
- `-.`が数字ならば、`#.#.`でヘッダーに数字がついてもいいのではないか？
- `xxx.bookmark.tm`, `xxx.image.tm`

---[ ? ]---

```tm
#( Header )[ 
コンテンツ
]
```
```
#[ Header1 ]-----------------------
##[ Header2 ]----------------------
###[ Header3 ]---------------------
---[ Bar ]-------------------------
```
```
→ -> <-
>[ Header ]
> AAAA
```

#[ アウトライン記法 ]

ネストが深く書ける唯一の存在と言っても過言ではない。私は、アウトラインを好む（ブロックな感じが好き。）
だが、他のほとんど共通の規則から離れた規則を所持しているため、慎重に。

---[ 現在対応 ]---

```tm
- aaaaaaaa
-. aaaaaaaa                 // 発明だと思う。地の文でも読みやすいんだから。
```

---[ 追加したいこと ]---

```tm
- (x) Todoリスト用            // - [x] ではないのは、tm記法の統一性のため。実際は、`-(variant:x)[Todoリスト用]`みたいな感じになっているのではなかろうか？
- [ aaaaaaaaaaaaa
    bbbbbbbbbbbbb ]          // よく話題にされるやつ。ただtmであれば、明確に改行を含めることができるのではないか？
  - ccccccc
  - ddddddd
もしくは、
-[ aaaaaaaaaaaaa ]           // こちらは、完璧な構文と言えないだろうか？tmフォーマットと完全にマッチしてしまっている。
--[ aaaaaaaaaaaaaaaa ]       // そして案外、見た目も悪くない...
-[ aaaaaaaaaaaa
   aaaaaaaaaaaa ]
-(x)[ aaaaaaaaaaaaaa ]
--(T)[ aaaaaaaaaaaaaa ]
---(@)[ aaaaaaaaaaaaaa ]     // そうは言っても、`---[]---`と若干被っている可能性もある。
--(a)[ aaaaaaaaaaaaaa ]
-(!)[ aaa ]{tag:asdfsdf}     // 誰もが一度は憧れたのではないだろうか。アウトラインにタグやidを付けて、リンクしたいと。
--(?)[ z ]{id:dsff-sdfd}     // ObsidianのDataviewやTasksなどを見れば、一目瞭然である。
```

実は、ここまで私のほしかったものを実現してくれたのであれば、リストにはもうちょっと頑張ってもらいたい。

#[ 関数の属性(配置コンテキスト) ]

##[ インライン属性 ]

[]の中や文字の途中で使用できる。

<codeblock>(lang:tm)[
  **aaaa**
  *aaaa*
  ==aaaa==
  _aaaa_
  `aaaa`
  <icon>()
  @link[]()
  @import()
  $(a.a)
  @tag[]
]

---[ アイデア ]---

@ではなく、$を使用して明示的に区別できるようにする？

##[ ブロック属性(行属性) ]

行を独占する。その後に何かを記入することは基本無い(書けるけど。行の最初にスペースすらもかけないってこと。)。

<codeblock>(lang:tm)[
  @config()
  @meta(){}
  ##[]{}
  <index>()
  <codeblock>()
  <blockquote>[]
]

##[ 例外 ]

書いた後のものに特殊な動作をさせる。
後継がネストされる。

---[ 構造化 ]---
```
  #[ Header ]
  # [ Header ]
  >[ Header ]
  ---[💫]---
  - - - -
```

---[ アウトライン ]---
```tm
  -. Outline
  - Outline
  -( )[ Outline ]
  - ( ) Outline
```

---[ コメント ]---
```tm
//
```

#[ 新しい関数 ]

- @tag[unko]
- <index>(){}
- <template>
- <time>

---[ 必要か？な関数 ]---

あるいは、計算して其の結果を反映するという面では、${var}というのと似ているため、$にする？

- $regex(/*.svg/g)
- $add(a, b)
- $math()
- $summury()
- ${a % b}みたいに、中で書けるようにするみたいな方がいいのでは？

もし実装するのであれば、obsidian basesをある程度参考にしたいかも。

#[ コメント用構文？ ]

- コメントにもネストの概念やヘッダーの概念がほしくない？
- 最小軽量構文
- できれば、他言語との統合が可能。みたいな（IDEで）

#[ 変数定義の独自軽量言語 ]

- ()の中に書くやつ。
```
var:value;
var=value;
var:value,
```
